app/controllers/projects_controller.rb

INSERT INTO "projects" ("project_name", "date", "description", "team_needs", "contact_email", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @project = current_user.projects.build(project_params)

    if @project.save

UPDATE "projects" SET "date" = $1, "description" = $2, "updated_at" = $3 WHERE "projects"."id" = $4  [["date", "2019-04-09 00:00:00"], ["description", "sells apples"], ["updated_at", "2019-04-29 21:25:12.186446"], ["id", 5]]
---
  def update
    if @project.update(project_params)

SELECT  "projects".* FROM "projects" WHERE "projects"."user_id" = $1 AND "projects"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 0], ["LIMIT", 1]]
---
    def set_project
      @project = current_user.projects.find(params[:id])